# -*-coding:utf-8-*-

import string

# 手机号正则
PHONE_REGEXP_STR = r'^1(?:3\d|4[5|7]|5[0-35-9]|6[267]|7[013-8]|[89]\d)\d{8}$'

# 邮箱正则
# EMAIL_REGEXP_STR = r'^[0-9a-zA-Z]+(?:[\.][0-9a-zA-Z]+)*@[0-9a-zA-Z]+(?:[\.][0-9a-zA-Z]+)*\.[0-9a-zA-Z]+$'
EMAIL_REGEXP_STR = r'^[a-zA-Z0-9_-]+@[a-zA-Z0-9_-]+(\.[a-zA-Z0-9_-]+)+$'

# 密码正则（6-18位，字母，数字，特殊字符的任意两种组合）
# PASSWORD_REGEXP_STR = (r'^(?!\d+$)(?![a-zA-Z]+$)'
#                        + r'(?![' + string.punctuation + r']+$)'
#                        + r'[\da-zA-Z' + string.punctuation + r']{6,18}$')

# 身份证正则 password_regexp_str
ID_CARD_REGEXP_STR = r'^(?<!\d)(?:(?:([1-9]\d{5}(?:18|19|(?:[23]\d))\d{2}(?:(?:0[1-9])|(?:10|11|12))(?:(?:[0-2][1-9])|10|20|30|31)\d{3}[0-9Xx])(?!\d))|([1-9]\d{5}\d{2}(?:(?:0[1-9])|(?:10|11|12))(?:(?:[0-2][1-9])|10|20|30|31)\d{3}))(?!\d)$'

# 密码正则（密码至少6位，最多16位，包含大、小写字母、数字、及符号）
# PASSWORD_REGEXP_STR = r'^(?:(?=.*[A-Z])(?=.*[a-z])(?=.*[0-9])(?=.*[\W_])).{6,16}$'

# 密码长度为8-16位字符，至少含大小写字母、数字、以及符号中任意2种组合
PASSWORD_REGEXP_STR = r"(?!^\d+$)(?!^[A-Za-z]+$)(?!^[^A-Za-z0-9]+$)(?!^.*[\u4E00-\u9FA5].*$)^\S{8,16}$"
